40k-dps.org
#+title:     40K DPS
#+author:    Logan Barnett-Hoy
#+email:     logustus@gmail.com
#+date:      <2021-06-26 Sat>
#+language:  en
#+file_tags:
#+tags:

* literate program

This is a literate program. Changes to the program should be made in this file
and then the final =.el= file created using =org-babel=. See [[entry point]] for the
entry point to the program.

* entry point

The program always starts with these things:

#+begin_src emacs-lisp :noweb yes :tangle t
;;; 40k-dps.el --- Calculate 40k attack/defense averages -*- lexical-binding: t; -*-
;;
;; Copyright (C) 2021 Logan Barnett-Hoy
;;
;; Author: Logan Barnett-Hoy <https://github.com/logan>
;; Maintainer: Logan Barnett-Hoy <logustus@gmail.com>
;; Created: June 26, 2021
;; Modified: June 26, 2021
;; Version: 0.0.1
;; Keywords: Symbol’s value as variable is void: finder-known-keywords
;; Homepage: https://github.com/logan/40k-dps
;; Package-Requires: ((emacs "24.3"))
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:
;;
;; Computes average damage from a given salvo of weapons fire or attacks in the
;; grimdark game of Warhammer 40,000 by Games Workshop.
;;
;;; Code:

(provide '40k-dps)
;;; 40k-dps.el ends here
#+end_src

** TODO include dependency metadata

This requires =dash= and we should make that apparent.

* test framework

We should probably pull in a unit testing library, but this worked in a pinch.

#+name: wh40k/test
#+begin_src emacs-lisp :results none
(defun wh40k/test (expected fn &rest args)
  (let ((result (apply fn args)))
    (cond
     ((string-equal (format "%s" expected) (format "%s" result)) t)
     (t `(,expected . ,result))
     )
    )
  )
#+end_src
* debugging
** TODO implement debugging or pull in dependency

Having log levels is important. We can leave debugging information in but not
clutter up our message buffer unless we're specifically debugging.

* org-table

=org-mode='s table support is very helpful, but we have some common actions that
it doesn't immediately provide.

** Look up a field using a column name
We expect tables to come with a table header, and the table headers are
documented (currently in just [[README.org]]). We need a handy method of looking up
the field using a column name.


#+begin_src emacs-lisp :results none
(defun wh40k/org-table-lookup (column-name table row)
  "Get field value from ROW using COLUMN-NAME found in TABLE."
  (let (
        (header-index
         (-elem-index
          column-name
          (car table)
          ))
        )
    (message "index at %s" header-index )
    (message "row %s" row)
    (message "output at %s: %s" header-index (nth header-index row))
    (nth header-index row)
    )
  )
#+end_src

We frequently convert the value to a =number= so let's make a convenience
function for getting the value and doing the conversion.

#+begin_src emacs-lisp :results none
(defun wh40k/org-table-lookup-n (&rest args)
  "Get numberic table value using `wh40k/org-table-lookup' ARGS."
  (string-to-number (apply #'wh40k/org-table-lookup args))
  )
#+end_src

** Get a table and convert it to a 2D Lisp list

Using =org-table-to-lisp= we can get a table at =point= or from the =TXT=
parameter. We need to be able to get the table by its =name= property.

#+begin_src emacs-lisp :results none
;; We have some special rows:
;; Row 2: header row - I need this.
;; Row 3: hline - drop it.
(defun wh40k/org-table-keep-row (row)
  "Indicate if ROW is not an hline."
  (cond
   ((equal 'hline row) nil)
   (t t)
   )
  )

(defun wh40k/org-table-lisp-from-name (tblname)
  "Find an org-table named TBLNAME in the current buffer."
  (save-excursion
    (let* (
           (table
            (org-element-map (org-element-parse-buffer) 'table
              (lambda (element)
                (when (string= tblname (org-element-property :name element))
                  element))
              nil ;info
              t )) ; first-match
           )
      (goto-char (org-element-property :contents-begin table))
      (-filter #'wh40k/org-table-keep-row (org-table-to-lisp))
      )
    )
  )
#+end_src

#+name: test-table-to-lisp
| name | value |
|------+-------|
| foo  | bar   |

#+begin_src emacs-lisp
(wh40k/org-table-lisp-from-name "test-table-to-lisp")
#+end_src

#+RESULTS:
| name | value |
| foo  | bar   |


** TODO memoize =wh40k/org-table-lookup=

We should consider memoizing this function at some point.
* the big function

#+begin_src emacs-lisp :results none
(defun wh40k/damage-probability-all-weapons-to-defender (
                                 weapon-profile-table-name
                                 defense-profile-table-name
                                 defender
                                 )
  "Calculate damage statistics WEAPON-PROFILE-TABLE-NAME against DEFENDER using DEFENSE-PROFILE-TABLE-NAME."
  (let* (
         (defense-profiles (wh40k/org-table-lisp-from-name
                            defense-profile-table-name))
         (weapon-profiles (wh40k/org-table-lisp-from-name
                           weapon-profile-table-name))
         (defender-row (-find
                        (lambda (d)
                          (string-equal
                           (wh40k/org-table-lookup "name" defense-profiles d)
                           defender))
                        defense-profiles))
         )
    (message "defense-profles %s" defense-profiles)
    (message "weapon-profles %s" weapon-profiles)
    (-map
     (lambda (row)
       (message "row %s" row)
       (let*
           (
            (weapon-name (wh40k/org-table-lookup "name" weapon-profiles row))
            (defender-name (wh40k/org-table-lookup "name" defense-profiles defender-row))
            ;; Defensive traits.
            (hit-mod (wh40k/org-table-lookup-n "hit" defense-profiles defender-row))
            (toughness (wh40k/org-table-lookup-n "t" defense-profiles defender-row))
            (save (wh40k/org-table-lookup-n "v" defense-profiles defender-row))
            (invulnerable (wh40k/org-table-lookup-n "i" defense-profiles defender-row))
            (resist-damage (wh40k/org-table-lookup-n "res" defense-profiles defender-row))
            (feel-no-pain (wh40k/org-table-lookup-n "fnp" defense-profiles defender-row))
            ;; Offensive traits.
            (ballistic-skill (wh40k/org-table-lookup-n "bs" weapon-profiles row))
            (attacks (wh40k/org-table-lookup "a" weapon-profiles row))
            (strength (wh40k/org-table-lookup-n "s" weapon-profiles row))
            (armor-penetration (wh40k/org-table-lookup-n "ap" weapon-profiles row))
            (damage (wh40k/org-table-lookup "dmg" weapon-profiles row))
            ;; Computed.
            ;; TODO: name this better.
            (attacks-multiplier (wh40k/damage-multiplier attacks 0))
            (to-hit-multiplier (wh40k/d6-from-plus (- ballistic-skill hit-mod)))
            (to-wound-multiplier (wh40k/d6-from-plus
                                  (wh40k/strength-vs-toughness
                                   strength
                                   toughness)))
            (save-multiplier
             (wh40k/d6-from-plus-negate
              (wh40k/ap-vs-save armor-penetration
                                save
                                invulnerable)
              )
             )
            (damage-multiplier (wh40k/damage-multiplier damage resist-damage))
            (feel-no-pain-multiplier (wh40k/d6-from-plus-negate feel-no-pain))
            )
         (message "row:
weapon-name:             %s
defender-name:           %s
attacks-multiplier:      %s
to-hit-multiplier:       %s
to-wound-multiplier:     %s
save-multiplier:         %s
damage-multiplier:       %s
feel-no-pain-multiplier: %s
"
                  weapon-name
                  defender-name
                  attacks-multiplier
                  to-hit-multiplier
                  to-wound-multiplier
                  save-multiplier
                  damage-multiplier
                  feel-no-pain-multiplier
                  )
         ;; (message "processing row...")
         ;; (message "damage %s" damage)
         ;; (message "resist-damage %s" resist-damage)
         ;; (message "feel-no-pain %s" feel-no-pain)
         ;; (message "save: %s" (wh40k/ap-vs-save armor-penetration
         ;;                                       save
         ;;                                       invulnerable))
         ;; (message "computed save: %s" (wh40k/d6-from-plus (wh40k/ap-vs-save armor-penetration
         ;;                                                                    save
         ;;                                                                    invulnerable)))
         (list
          weapon-name
          defender-name
          (*
           attacks-multiplier
           to-hit-multiplier
           to-wound-multiplier
           save-multiplier
           damage-multiplier
           feel-no-pain-multiplier
           )
          )
         )
       )
     (-drop 1 weapon-profiles)
     )
    )
  )
#+end_src

** TODO break the big function up

We need some more variations too. We can start by breaking out the row handling.

* dice

** successes
The =d6= is the die of the Warhammer 40,000 world. Generally a given die roll is
described by a number we need to meet or exceed. In the vernacular it is said
like "<number> plus", like "five plus" to roll a 5 or 6, and one through four
are considered failures. The notation for this is "5+".

We can represent these greater-than-or-equal-to rolls with a percentage.

#+begin_src emacs-lisp :results none
(defun wh40k/d6-from-plus (n)
  "Calculates the percentage probability of a d6 roll of N or greater."
  (cond
    ((> n 6) 0)
    (t (/ (- 7 (max 2 n)) 6.0))
  ))
#+end_src

Tests:
#+begin_src emacs-lisp
(list
 (wh40k/test (/ 1.0 6.0) #'wh40k/d6-from-plus 6)
 (wh40k/test (/ 5.0 6.0) #'wh40k/d6-from-plus 1)
 (wh40k/test (/ 5.0 6.0) #'wh40k/d6-from-plus 2)
 (wh40k/test 0 #'wh40k/d6-from-plus 7)
 )
#+end_src

#+RESULTS:
| t | t | t | t |

** failing successes
While =wh40k/d6-from-plus= works great for including successes, we can consider
things like saving throws as a failure on the number met. So in the event of a
3+ armor save, a roll of a three or higher will cause the damage attempt to
fail. We need an inverted percentage for this.

#+begin_src emacs-lisp :results none
(defun wh40k/d6-from-plus-negate (n)
  "Calculates the percentage chances of rolling N or lower on a d6."
  (cond
    ((> n 6) 1.0)
    (t (/ (max 1.0 (- n 1)) 6.0))
  ))
#+end_src

#+begin_src emacs-lisp
(list
 (wh40k/test 1.0 #'wh40k/d6-from-plus-negate 7)
 (wh40k/test (/ 5.0 6.0) #'wh40k/d6-from-plus-negate 6)
 (wh40k/test (/ 1.0 6.0) #'wh40k/d6-from-plus-negate 2)
 (wh40k/test (/ 3.0 6.0) #'wh40k/d6-from-plus-negate 4)
 (wh40k/test (/ 2.0 6.0) #'wh40k/d6-from-plus-negate 3)
 ;; We can't ever get better than +2 save.
 (wh40k/test (/ 1.0 6.0) #'wh40k/d6-from-plus-negate 1)
 )
#+end_src

#+RESULTS:
| t | t | t | t | t | t |

