40k-dps.el
;;; 40k-dps.el --- Calculate 40k attack/defense averages -*- lexical-binding: t; -*-
;;
;; Copyright (C) 2021 Logan Barnett-Hoy
;;
;; Author: Logan Barnett-Hoy <https://github.com/logan>
;; Maintainer: Logan Barnett-Hoy <logustus@gmail.com>
;; Created: June 26, 2021
;; Modified: June 26, 2021
;; Version: 0.0.1
;; Keywords: Symbol’s value as variable is void: finder-known-keywords
;; Homepage: https://github.com/logan/40k-dps
;; Package-Requires: ((emacs "24.3"))
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:
;;
;; Computes average damage from a given salvo of weapons fire or attacks in the
;; grimdark game of Warhammer 40,000 by Games Workshop.
;;
;;; Code:

(defun wh40k/org-table-lookup (column-name table row)
  "Get field value from ROW using COLUMN-NAME found in TABLE."
  (let (
        (header-index
         (-elem-index
          column-name
          (car table)
          ))
        )
    (message "index at %s" header-index )
    (message "row %s" row)
    (message "output at %s: %s" header-index (nth header-index row))
    (nth header-index row)
    )
  )
(defun wh40k/org-table-lookup-n (&rest args)
  "Get numberic table value using `wh40k/org-table-lookup' ARGS."
  (string-to-number (apply #'wh40k/org-table-lookup args))
  )
;; We have some special rows:
;; Row 2: header row - I need this.
;; Row 3: hline - drop it.
(defun wh40k/org-table-keep-row (row)
  "Indicate if ROW is not an hline."
  (cond
   ((equal 'hline row) nil)
   (t t)
   )
  )
(defun wh40k/org-table-lisp-from-name (tblname)
  "Find an org-table named TBLNAME in the current buffer."
  (save-excursion
    (let* (
           (table
            (org-element-map (org-element-parse-buffer) 'table
              (lambda (element)
                (when (string= tblname (org-element-property :name element))
                  element))
              nil ;info
              t )) ; first-match
           )
      (goto-char (org-element-property :contents-begin table))
      (-filter #'wh40k/org-table-keep-row (org-table-to-lisp))
      )
    )
  )
(defun wh40k/d6-from-plus (n)
  "Calculates the percentage probability of a d6 roll of N or greater."
  (cond
    ((> n 6) 0)
    (t (/ (- 7 (max 2 n)) 6.0))
  ))
(defun wh40k/d6-from-plus-negate (n)
  "Calculates the percentage chances of rolling N or lower on a d6."
  (cond
    ((> n 6) 1.0)
    (t (/ (max 1.0 (- n 1)) 6.0))
  ))
