40k-dps.el
(defun wh40k/d6-with-reroll (n r)
  "Compute success chance roll of N+ on a d6, with a reroll of R or below."
  ;; If r + 1 >= n, we reroll everything. So it's %n + %n * %n.
  ;; If r < n, we reroll r and lower. %n + %n * %(r + n).
  (cond
   ;; ((>= r n) (wh40k/d6-from-plus n))
   ((>= (+ r 1) n) (-
                    (* 2 (wh40k/d6-from-plus n))
                    (expt (wh40k/d6-from-plus n) 2)
                    ))
   (t (-
       (* 2 (wh40k/d6-from-plus n))
       ;; 3+ reroll 1
       ;; 4/6 succeed plus half of 2/6 * 4/6.
       ;; 4/6 + 4/6 * 4/6 * 0.5 = 0.88888889 <- wrong
       ;; (4/6 * 2) - (4/6)^2 * 1/6 = 0.88888889
       ;; 3+ reroll all
       ;; 4/6 succeed plus all of 2/6 * 4/6.
       ;; 4/6 + 4/6 * 4/6 * 1 = 1.11111111  <- wrong
       ;; (4/6 * 2) - (4/6)^2 = 0.88888889
       ;; (/
        (* (wh40k/d6-from-plus r) (wh40k/d6-from-plus n))
        ;; (/ r 6)
        ;; (- 1 (/ r 6))
        ;; )
       )
      )
   )
  )
(defun wh40k/strength-vs-toughness (strength toughness)
  "The d6 roll to wound with STRENGTH against TOUGHNESS."
  (cond
      ((>= strength (* toughness 2)) 2)
      ((<= (* strength 2) toughness) 6)
      ((> strength toughness) 3)
      ((< strength toughness) 5)
      (t 4)
      )
  )
;; Apply armor penetration to the save. If the save is worse than the
;; invulnerable, use the invulnerable. Returns a percentage reduced by saves.
(defun wh40k/ap-vs-save (ap save invulnerable)
  "The d6 roll needed to ignore wound using SAVE or INVULNERABLE based on AP.

If no save or invulnerable, use 7 or higher. AP should be a negative value
generally, but could be positive to reflect cover or other factors."
  (min
   7
   (cond
    ((> (- save ap) invulnerable) invulnerable)
    (t (- save ap))
    )
   )
  )
(defun wh40k/damage-die (damage-notation)
  "The rolled segment of DAMAGE-NOTATION."
  (string-to-number
   (save-match-data
     (if (string-match "d\\([\\[:digit:]]\\)" damage-notation)
         (match-string 1 damage-notation)
       "0"
       )
     )
   )
  )
(defun wh40k/damage-parse (damage)
  "Parse a DAMAGE notation into a tuple of random and constant values.

Examples:
(wh40k/damage-parse \"d3\")   ; '(3 0)
(wh40k/damage-parse \"d3+3\") ; '(3 3)
(wh40k/damage-parse \"2\")    ; '(0 2)
"
  (let* (
         ;; Make the notation uniform. "D3 + 3" becomes "d3+3", etc.
         (dmg-clean (replace-regexp-in-string
                     " "
                     ""
                     (downcase damage)))
         (variable (wh40k/damage-die dmg-clean))
         (die-text (concat "d" (number-to-string variable)))
         (dmg-sans-die
          ;; We cannot do negative lookbehinds in Emacs Lisp, so we must instead
          ;; extract the die. Fortunately we just got it, so it's a replace
          ;; away.
          (replace-regexp-in-string
           (regexp-quote die-text)
           ""
           dmg-clean
           )
          )
         (constant (save-match-data
                     (if (string-match
                          "\\([\\[:digit:]]+\\)"
                          dmg-sans-die
                          )
                         (match-string 1 dmg-sans-die)
                       "0"
                       )
                     ))
         )
    (list
     (cond
      ((= variable 3) (/ 3.0 2.0))
      ((= variable 6) (/ 6.0 2.0))
      (t 0.0)
      )
     (string-to-number constant)
     )
    )
  )
