40k-dps.org
*** Damage Resistance

When the damage is something like =d6= the average result reflects that there is
a one in six chance - easy stuff. However when we apply the damage resistance
for things like "Disgustingly Resilient" or the Wave Serpent's Serpent Shield,
we get a reduction of 1 damage, down to a minimum of 1. This means our =d6=
becomes something like =(min (- d6 1) 1)=. As far as probability space goes,
this means that there's a two in six chance of rolling a 1, and a 4 in 6 chance
of rolling some other number. The probability works out such that we can say 2/6
is 1, and 4/6 is the average of 2 through 5, or 1.5+1 or 2.5.

2/6 = 1
4/6 = 2.5

Then we do some weighting. An average of an average... is that okay?

(1 + 1 + 2.5 * 4) / 6 = 2

Wow, this effect is powerful. However it only applies to weapons who have a
damage of more than (or possibly more than) 1.

With a =d3=, the results should be similar.
2/6 = 1
4/6 = 1.5
(1 + 1 + 1.5 * 4) / 6 = 1 1/3

The total formula looks like this:

(2 + ((d + 2) / 2 - 1)) / 6 = x

#+begin_src emacs-lisp :results none
;; This only works with a resistance of 1. Need to refine formula for more when
;; the need arises.
(defun wh40k/damage-resist-from-die (die)
  "Average the reduction of DIE damage amount by 1, to a minimum of one."
  (/ (+ 2.0 (* 4.0 (- (/ (+ 2.0 die) 2.0) 1.0))) 6.0)
  )
#+end_src

#+begin_src emacs-lisp
(list
  (wh40k/test (+ 1.0 (/ 1.0 3.0)) #'wh40k/damage-resist-from-die 3)
  (wh40k/test (+ 2.0 (/ 1.0 3.0)) #'wh40k/damage-resist-from-die 6)
  )
#+end_src

#+RESULTS:
| t | t |


This gets us the total damage percentage/multiplier:

#+begin_src emacs-lisp :results none
(defun wh40k/damage-multiplier (damage-notation resist)
  (let* (
         (damage-pair (wh40k/damage-parse damage-notation))
         ;; Keep in mind this is not the die itself, but the variable average
         ;; from the die.
         (variable (car damage-pair))
         (constant (car (cdr damage-pair)))
         )
    (message "constant %s" constant)
    (message "variable %s" variable)
    (cond
     ;; Nothing to do here if we resist nothing.
     ((= resist 0) (+ constant variable))
     ;; Do not deduct damage if it is just 1.
     ((and (= constant 1) (= variable 0.0)) 1.0)
     ;; If the constant is > 1, we can safely deduct 1 always.
     ((> constant 1) (+ variable (- constant 1)))
     ;; If we just have a die, we have to do some computation.
     ((> variable 0.0) (wh40k/damage-resist-from-die
                        (wh40k/damage-die damage-notation)))
     ;; That _should_ be all the cases.
     (t nil)
      )
    )
  )
#+end_src

#+begin_src emacs-lisp
(list
  (wh40k/test 1.5 #'wh40k/damage-multiplier "d3" 0)
  (wh40k/test (+ 1.0 (/ 1.0 3.0)) #'wh40k/damage-multiplier "d3" 1)
  (wh40k/test (+ 2.0 (/ 1.0 3.0)) #'wh40k/damage-multiplier "d6" 1)
  (wh40k/test 6.0 #'wh40k/damage-multiplier "d6+3" 0)
  (wh40k/test 5.0 #'wh40k/damage-multiplier "d6+3" 1)
  (wh40k/test 6.0 #'wh40k/damage-multiplier "6" 0)
  (wh40k/test 12.0 #'wh40k/damage-multiplier "12" 0)
  ;; TODO: Handle 2d6.
  )
#+end_src

#+RESULTS:
| t | t | t | t | t | t | t |



* COMMENT Settings
#  LocalWords:  AP
